app/Http/Controllers/Admin/OwnersController.php

    public function index()
    {
        // $date_now = Carbon::now();
        // $date_parse = Carbon::parse(now());
        // echo $date_now->year;
        // echo $date_parse;

        // $e_all = Owner::all();
        // $q_get = DB::table('owners')->select('name', 'created_at')->get();
        // $q_first = DB::table('owners')->select('name')->first();

        // $c_test = collect([
        //     'name' => 'てすと'
        // ]);

        // var_dump($q_first);

        // dd($e_all, $q_get, $q_first, $c_test);
        $owners = Owner::select('id', 'name', 'email', 'created_at')->get();
---
select `id`, `name`, `email`, `created_at` from `owners`

    public function store(Request $request)
    {
        //$request->name;
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|string|email|max:255|unique:owners',
            'password' => 'required|string|confirmed|min:8',
        ]);

        Owner::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into `owners` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('test', 'test10@test.com', '$2y$10$nWHWG1pa5Y4/9c45g/IXAuoidlLHTV4P5stLWzz6R7D0Dp2bVplxa', '2022-10-26 00:03:24', '2022-10-26 00:03:24')

    public function edit($id)
    {
        $owner = Owner::findOrFail($id);
---
select * from `owners` where `owners`.`id` = '1' limit 1

    public function update(Request $request, $id)
    {
        $owner = Owner::findOrFail($id);
---
select * from `owners` where `owners`.`id` = '1' limit 1